[
{"post": "Computer Operator", "company_name": "Nippon Fish and Poultry Feeds Limited", "location": "Dhaka", "deadline": "Jul 26, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68395", "salary_range": "To be mention by the Applicant/ Negotiable", "experience": "Minimum  1 year.", "educational_requirements": ["Minimum SSC."], "job_responsibility": ["Prepare and type all sorts of documents in Bangla and English at least 1 year practical experience ", "Strong knowledge at excel and word file for any work. ", "Must have skills,e-gp tendering,fast typing skill in bangle & english", "Any other work as assigned by the authority."]},
{"post": "IT Officer", "company_name": "LAILA STYLES LTD.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67691", "salary_range": "Negotiable", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor degree in any discipline"], "job_responsibility": ["Fully responsible for the IT section of a Garment Factory"]},
{"post": "PHP Developer", "company_name": "Earthmoving Solution Ltd", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67696", "salary_range": "Negotiable", "experience": "5 to 6 year(s)", "educational_requirements": ["Candidates can be any educational background but with highly skilled at the programming"], "job_responsibility": ["Proactively engage in the planning, design, implementation and support to produce a successful software", "Follow and contribute to development best-practices, code reviews on a daily basis", "Constantly improve as a developer and a team member, share knowledge and help other team members grow", "Any other task as assigned by the management"]},
{"post": "E-commerce IT Executive", "company_name": "Isharify Ltd", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67701", "salary_range": "Negotiable", "educational_requirements": ["Bachelor of Business Administration (BBA), Bachelor of Business Studies (BBS), Bachelor in Engineering (BEngg) in CSE, Bachelor in Engineering (BEngg) in EEE"], "job_responsibility": ["Isharify Limited is a fast-growing ecommerce solution provider company in Dhaka searching for an Ecommerce IT Executive with great computer knowledge and English (Written and Spoken) Communication Skill to develop a good relationship between the customer and the client to deliver the best possible service. Due to the worldwide outbreak of COVID -19, employees should be working remotely from home and when the situation is normal, willing to work from office as usual and Must have good personal computer configuration for remote work. Please do not apply if required requirements are not fulfilled.", "The ideal candidate.", "Ability to multi-task and adhere to deadlines.", "Excellent communicator (verbal and written).", "Loves to tinker with new technology.", "Detailed oriented.", "Great at explaining and documenting how something works verbally and written.", "Communicating with foreign clients fluently and making them understand about the clients' needs.", "Understanding and Handling the requirements of the project, conveying the message to our internal teams and making sure the tasks are being done properly.", "Building an outstanding relationship with our clients through regular and proper follow-ups.", "Managing and leading the team and aligning them with client's requirements.", "Understanding the scope of our business and building and nurturing client relations according to that.", "Creating and maintaining an excellent level of customer satisfaction for Clients ecommerce business.", "Candidates must be able to comprehend our visions for the future and cultivate a strong and self-motivated personality.", "Handle difficult situations on the spot with excellent critical thinking ability.", "Understanding the technical aspect of our work properly to communicate with the clients.", "Researching on Client's products and market properly to ensure satisfactory service.", "Organizing project tasks and creating workflows that will ensure satisfactory service for the client.", "Writing Proposals, Email and other business letters in a very official manner.", "Understanding the business of the clients and keeping up with changes.", "Continuous learning and studying to come up with new ideas."]},
{"post": "Trainee Engineer", "company_name": "Technomedia Limited", "location": "Any where in Bangladesh", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67686", "salary_range": "Negotiable", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science & Engineering, Bachelor in Engineering (BEngg) in EEE, Diploma in Engineering in Electrical & Electronic Engineering"], "job_responsibility": ["Providing remote support to the operation team on 24x7 basis", "Deployment of ATM Booths i.e., site visiting, monitor the operation of ATM", "Daily ATM visit, resolve the ATM related issues", "Response to down calls of ATM and follow up till the problem resolve", "ATM monitoring and testing for smooth operation", "Repair bench diagnosing, checking and repairing activities", "Managing parts and components stock at warehouse/site offices", "Ongoing repairs and preventative maintenance of installed ATMs", "Meeting with senior/manager regarding any issues and its solutions", "Preparing operational and technical reports on an ongoing basis"]},
{"post": "Digital Marketing Manager", "company_name": "Scholars Zone", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67697", "salary_range": "Tk. 25000 - 30000 (Monthly)", "experience": "2 to 3 year(s)", "educational_requirements": ["Bachelor degree in any discipline, Masters degree in any discipline"], "job_responsibility": ["Develop and manage digital/online marketing campaigns.", "Oversee a social media strategy.", "Track and analyse website traffic flow and provide regular internal reports.", "Write copy for email marketing campaigns.", "Identify new trends in digital marketing, evaluate new.", "Solid understanding of web metrics, digital analytics, with the ability to generate, analyse and interpret data.", "Must be able to work under constant deadline pressure and manage multiple projects across multiple lines of business.", "Strong management skills, excellent oral and written communication skills.", "Experience delivering digital campaigns for mainstream products and services"]},
{"post": "IT Officer/Executive", "company_name": "Deen Group", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67704", "salary_range": "Negotiable", "experience": "3 to 5 year(s)", "educational_requirements": ["Diploma in Computer, Bachelor of Computer Application (BCA)"], "job_responsibility": ["Develop and improve IT standards and services to support Company's regular work and activities.", "Good skill and knowledge on outlook, mail system, switch, router, IT networking, IT security.", "Installing and configuring computer hardware, software, systems, networks, printers and scanners.", "Responsible for handling network configuration, networking equipment, server applications, database backup, buyer software, operating system, driver software, application software, email with backup system etc.", "Make sure the stability, reliability, and security of all systems.", "Maintain proper documentation for updating inventory of all hardware and IT products and information.", "Ensure all backups are completed as per documented processes.", "Ensure setting up and configuring new laptops and desktops.", "Ensure Installing authorized software to laptops and desktops.", "Company user mail configure in Microsoft outlook.", "Setting up email accounts for new users.", "Communicates with vendors for technical support and program updates as needed to resolve.", "Develop and manage digital marketing campaigns", "Maintain relationships with e-commerce retail partners and manage partner/client expectations", "Coordinate site content strategy and updates i.e. product pages, new and existing landing pages, product changes/updates/launches, etc. on make website and with e-retail partners", "Work with retail e-commerce partners to obtain analytics on retailer programs as well as overall sales goals/ strategies", "Must have known graphic Design work."]},
{"post": "Officer - Network Engineer", "company_name": "Nexdecade Technology (Pvt.) Ltd", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67705", "salary_range": "15000 - 20000 depends on experience", "educational_requirements": ["Bachelor in any discipline /Diploma in IT", "Professional Certification: Networking Certification ,MS Server Certification will be added", "Skills Required: Switching & Routing"], "job_responsibility": ["Perform the installation, configuration, administration and maintenance and upgrade of networks (including servers, routers, firewalls, remote access systems and network management systems) and computer systems - VPNs, NAT & Routing.", "Solution design for LAN/MAN/WAN, Wireless and cloud-based networks.", "Provide technical support and troubleshoot problems with various clients and users with regards to LAN/MAN/WAN, Wireless and cloud-based networks.", "Good knowledge of cloud based applications and systems.", "Monitor network connectivity to ensure high quality data transmission.", "Capable for 24/7 Roster duty.", "Ensure minimum down time of switching and Transmission operations.", "Maintain traffic management, service quality, fault management and performance of system.", "Conduct background in IP/Layer 2/Layer 3 networking, LAN/WAN network architecture.", "Assess L2/L3 IP test plans, tunnel, QOS and acceptance criteria for network designs.", "Work in fast paced dynamic environment and under high pressure.", "Implementation of appropriate operational procedure for all core TX network deployments.", "Monitor Network system using MRTG, NMS, LG, IP Plan etc. tools.", "Operation and maintenance of LAN & WAN service.", "Diagnosing and troubleshooting hardware, software and network faults.", "Maintenance of PoP , streamer as per requirement.", "Support including real time network and client's networks, application and databases."]},
{"post": "Network Manager", "company_name": "Nexdecade Technology (Pvt.) Ltd", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67708", "salary_range": "30000 - 35000 Dependents on experience.", "experience": "At least 3 year(s)", "educational_requirements": ["CSE, EEE"], "job_responsibility": ["Establish system by planning and executing the selection, installation, configuration, and testing of server hardware, software, LAN and WAN networks and operating and system management systems; defining system and operational policies and procedures.", "Maintain LAN and Internet connectivity products (Core Switches, Routers and Firewall) and their installation and configuration. Also, configure and maintain VLANs, Site to Site and Remote Access VPNs, and Manage Secured User Access.", "Configure, troubleshoot, and maintain Active Directory, DNS Server and File Server on Windows Platform.", "Maintain Active Directory Users and Directories, Network Storages and Drive Mapping, Network Resources under Directory.", "Maintain Mail Server in Linux platform", "Configure, troubleshoot, and maintain Proxy, FTP and Web Server.", "Manage networks using Windows & Linux", "Support for Microsoft Windows client and server networking and Office software technologies", "Secures system by developing system access, monitoring, control, and evaluation; establishing and testing disaster recovery policies and procedures; completing back-ups; maintaining documentation.", "Prepares users by designing and conducting training programs; providing references and support.", "Practical Experience on standard software & hardware installation/maintenance and troubleshooting is a must.", "Technical proficiency in the following areas: Linux/Unix, Windows Server 2008 & 2003, Active Directory, Microsoft Windows Operating Systems (Windows XP, and Windows 7)", "Installation, configuration & troubleshooting of MS Exchange Server 2003 / 2010, Cisco Switches and Routers, Mikrotik, etc.", "Perform on-site/off-site/in-house service, maintenance and trouble shooting.", "Follow up and provide all sort of information required on a regular basis to management .", "Must have experience in Configuring Cisco devices (Routers, Switches), CCNA Preferable.", "Installation, commissioning, monitoring and troubleshooting of network equipment (Routers, Switches, OLT, Radio Link Devices, WiFi, AP etc.) at DC, NOC, PoPs and Customers Premise.", "Installation, commissioning, monitoring and troubleshooting of Data Centre equipment (Servers, UPS, GenSet, AC, PAC etc.)", "Has to be team player with strong interpersonal skill, regular reporting skills, and must have customer first attitude and interest in learning new technologies.", "NOC Support, highest priority Trouble Ticket handling, fault recognition and troubleshooting.", "Routing protocol expertise: BGP, OSPF, MPLS, and Static.", "Transmission planning, Network optimization.", "IPv4 and IPv6 address planning, allocation and configuration.", "Port, VLAN, ACL, Port-channel, Ether Channel, PBR configuration and troubleshooting.", "Deep Packet Inspection, packet capturing and analyzing and reporting, Port, URL, Content blocking", "Upstream circuit, NTTN and client provision, Communication, co-ordination & Maintenance", "Upstream BW management, Load balancing, traffic shaping, Route manipulation.", "Multiple project handling and co-ordination.", "Mentoring to subordinate colleagues/technicians, conducting trainings and presentations for fellow engineers.", "Ensure 24/7 (roster duty/NOC support) uninterrupted support to client."]},
{"post": "Deputy Manager / Asst. Manager - IT", "company_name": "A Reputed Freight Forwarding Company.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67715", "salary_range": "Negotiable", "experience": "At least 5 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science & Engineering , Major (Software )", "B.Sc. in Computer Science, MIS or similar field.", "Skills Required: Corporate IT Support, Linux-based Mail Server, Senior Software Engineer"], "job_responsibility": ["To manage the deployment Plan, design, monitoring, maintenance, upgrade, and support of all current IT systems.", "To configure and maintain Networking & Hardware Devices.", "To configure and manage windows Server 2012/2016.", "To configure Internal Server services like Active Directory, Backup Server, File Server, Print Server, Terminal Server, VPN,VLAN, FTP Server, Proxy Server, Mail Server, IP Phone Server, Doman Controller, DNS, and DHCP etc.", "To configure and manage Red control, Recovery System & Antivirus Server.", "To configure and manage Cisco Switch & Router, Wireless Router, Mikro Tik, NAT, Layer 7, Bandwidth Control etc.", "To configure and manage in network firewall security system.", "To configure and manage security systems alone with all IP Phone, IPPABX, FXO, FXS, DVR, NVR, XVR, IP Camera, CCTV, Camera, Attendance Devices & Access Control.", "To configure and manage Microsoft SQL Server-2000, 2008 & 2012, Visual Basic, Crystal Reports, Data Sources (ODBC)", "To Configure and manage Website, Email, Zimbra, Exchange, FTP in cPanel.", "To Lead, Develop and Plan ERP Projects using Oracle, Java, Net, Visual Basic, MS SQL", "To configure and troubleshoot (ERP) Software.", "To configure and manage QuickBooks Software & Hardware.", "To Must be support 24x7 (Over Phone or physically)", "To take up additional responsibilities as and when required.", "Responding in a timely manner to service issues and requests", "Responsible for Providing technical support across the company", "Ensure timely and accurate delivery of technology products and services", "Must be providing the PC support for 100-150 users.", "Must have knowledge of Operating system installation / troubleshoot.", "Must have Maintaining IT inventory management", "Must be willing to give any kind of IT support to users", "Responsible for all electronics devices of the office.", "Secures network system by establishing and enforcing policies; defining and monitoring access.", "IT procurement management: requisition analysis, quotation, proposal, budget, approval, bill checking", "Strong knowledge in Micro Tic router, Cisco router/switch, Network cabling, IP Address & Sub-netting.", "Setup/Configure/maintenance/troubleshoot/monitor DVR, NVR, CC/IP Camera, Mikro Tik /Cisco/ other brand Router/Switch/Access Point/Range Extender, AP controller, POE switch, network printer, Android Apps, necessary tools/software etc.", "Requirement analysis, testing, maintenance & update main website &different websites related to departments, media, events, research, IQAC, VC, Pro-VC etc.", "System/Data security, backup & recovery.", "Implement/update different IT services & policies. Time to time analysis & upgrade new equipment, system & technology.", "Any other activities assigned by the management from time to time."]},
{"post": "Graphics & Multimedia Artist/ Designer", "company_name": "Asian Global Ventures (Bangladesh) Company Ltd.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67729", "salary_range": "Negotiable", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor of Fine Arts (B.F.A), Bachelor degree in any discipline"], "job_responsibility": ["Work with team to understand the project scope and objectives that will drive engagement and awareness of our products and business activities.", "Participate in brainstorming sessions to share new design perspectives and ideas.", "Design new on-brand animation to effectively convey concepts and messaging.", "Work collaboratively with the Content Development Team, Creative Team, Content Writers, and other colleagues to develop creative multimedia materials.", "Using Adobe Photoshop CS and CC", "Computer Graphics Designing", "Logo, Images, Banner Design, Social Media Cartoon Design", "User Interface & User Experience for Websites and/or Mobile Devices", "Computer Art and Paintings", "Animation", "Flash and/or Aftereffects", "Creating new designs with creative concepts.", "Designing and creating new artwork for web, mobiles & tablets (applications/games)."]},
{"post": "Java Engineer", "company_name": "Dynamic Solution Innovators Limited", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67719", "salary_range": "Negotiable", "experience": "4 to 6 year(s)", "educational_requirements": ["Bachelor in Engineering (BEngg) in Computer Science Engineering"], "job_responsibility": ["Excellent knowledge on Java language.", "Spring - expert level skills with the Core Spring Framework.", "Great to have experience with spring MVC, spring Security, spring Integration.", "Must have good knowledge and experience in standard SQL.", "Experience with ORM tools will be a plus.", "Application Servers - general understanding of application server platforms Apache Tomcat or any other like JBoss, Websphere, Jetty is a must.", "Other programming language - general comfortable in more than one programming language and have a firm grasp of fundamental web/internet technologies. Experience/Knowledge in Perl, Python, C# is a plus.", "Testing - experience with JUnit, mockito or other mock object tools is a great plus.", "Familiarity with Development methodology like SCRUM, TDD is must.", "Data Mining - Experience and/knowledge of general data mining, statistics, machine learning techniques will be a huge plus."]},
{"post": "Senior Software Engineer (Python/Django)", "company_name": "Binate Solutions Ltd.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67713", "salary_range": "Compensation package will be competitive, and commensurate with experience and track record. Salary review in each year with performance.", "experience": "5 to 7 year(s)", "job_responsibility": ["Our developers work for leading service oriented companies in Europe and USA. We have various technical teams & we practice Agile on daily basis. We practice international culture & frequent foreign client calls are there everyday. We proudly call us Binate Family & we mean it. We provide world class friendly working environment. We don`t just find the best, we also provide the tools, training, and relationship building support to ensure success for long term growth.", "We are looking for smart developers, eager to work in an international environment.", "We're looking for Python/Django developers to join our core team. Responsibilities include developing core components for our SaaS based e-commerce platform with Python web frameworks.", "Provide technical guidance and assistance to other Jr. software engineers.", "Develop POCs/MVPs quickly.", "Optimize performance of web applications and create and utilize best standards.", "Design and documentation REST APIs, working with Facebook/Google Analytics etc. APIs", "Perform DevOps tasks with various CI/CD tools."]},
{"post": "Senior PHP Engineer", "company_name": "BJIT Ltd.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67724", "salary_range": "Negotiable", "experience": "At least 6 year(s)", "educational_requirements": ["Bachelor's degree in Computer Science or related field.", "Skills Required: CakePHP, django, Laravel, Node.js, PHP, Python, Symphony"], "job_responsibility": ["Strong communication with project technical team from abroad client", "Requirement understanding, provide technical solution, advanced support", "Technical implementation, deployment and Testing (Unit testing and manual testing)", "Maintain CI/CD, repository in GitHub, GitLab", "Proactive in communication, strong in problem solving, capability to maintain stress of end client", "Team leading, business understanding, planning and reporting"]},
{"post": "Web Developer", "company_name": "Saaaj Dyeing & Fabrics Ltd.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67714", "salary_range": "Negotiable", "experience": "At least 1 year(s)", "educational_requirements": ["Graduate in any subject"], "job_responsibility": ["We are looking for a highly experienced developer who is an expert on CodeIgniter and Laravel framework. She will be also responsible for managing back-end services and the interchange of data between the server and the users.", "Job Location - Dhaka (Mirpur DOHS)", "Responsible for all server-side logic, definition and maintenance of the database, and ensuring high performance and responsiveness.", "Responsible for integrating the front-end elements into the application.", "Work with team members to create plans, tasks, time estimates and timeline for delivery", "Provide day to day project management of team to achieve the project goals for their assignments", "Ensure HTML, CSS, PHP, jQuery, Bootstrap, MySQL, Apache, JavaScript, Amazon AWS.", "Object-oriented software development experience.", "Build efficient, testable, and reusable CodeIgniter and Laravel modules.", "Solve complex performance problems and architectural challenges.", "Have knowledge of WordPress and OpenCart customization from the start."]},
{"post": "Software Developer (PHP) Full Stack", "company_name": "Asian Global Ventures (Bangladesh) Company Ltd.", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67725", "salary_range": "Negotiable", "experience": "2 to 6 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science Engineering, Bachelor of Computer Application (BCA) in Computer Applications, Bachelor in Engineering (BEngg) in Computer Science", "CSE (Computer Science & Engineering) B.Sc or M.Sc"], "job_responsibility": ["Design overall architecture of the web application.", "Maintain quality and ensure responsiveness of applications.", "Collaborate with the rest of the engineering team to design and launch new features.", "Maintain code integrity and organization.", "Follow company procedure of day-to-day activities and rules & regulation strictly."]},
{"post": "Web Developer (Vue JS and Laravel)", "company_name": "RTC Hubs Limited", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67730", "salary_range": "Negotiable", "experience": "At least 1 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in CSE", "Skills Required: HTML5 & CSS3, Laravel Framework, Vue.js"], "job_responsibility": ["We need a full stack Laravel developer to finish our web-based application, the job is an ongoing task based according to our Gitlab Issue board", "You will be needing to help out with finishing projects and take care of the following:", "- Module customizations (VueJS Components, ES6, SPA)", "- Laravel HTTP REST JSON API", "- Laravel PHP - MySQL", "- OOP PHP", "- Expert skills in PHP Laravel and Veujs, Vuetify, web app development and deployment.", "- Required Skill(s): In depth up to date current knowledge of HTML5, CSS3, PHP7,MySQL, ORM", "- Able to communicate, listen, speak, read, write in English (minimum intermediate level)", "- Be proficient using Git"]},
{"post": "Mobile Application Developer (Android / iOS)", "company_name": "Asian Global Ventures (Bangladesh) Company Ltd.", "location": "Any where in Bangladesh", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67738", "salary_range": "Negotiable", "experience": "2 to 6 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science Engineering", "Skills Required: Android, iOS"], "job_responsibility": ["We are looking to hire a talented Android & iOS Developers to design, build, and maintain the next generation of Android & iOS applications. Your primary focus will be developing high-end Android & iOS applications for the latest Android & Apple mobile devices. Your duties may include collaborating with the design team for new application features, identifying and fixing application bottlenecks, maintaining the core code, and updating applications published on the Play & App Store.", "MUST HAVE APPS in APP STORE FOR REFERENCE.", "FIRST & MOST IMPORTANT requirement is that the applicant must have a serious passion for working with flexibility and adaptability in a continuously changing technological environment.", "Coding, Building, Debugging, Testing on multiple devices & troubleshooting both stand-alone apps & apps that require web-access along with complex clients with server interaction on Android SDK platforms interacting with appropriate Database and Hardware.", "Experience in Game Engine (AndEngine, LibGDX) for Game Development is an added advantage.", "Knowledge and experience in Google map api, GCM integration & socket programming in data and voice transmission is an advantage.", "Work with a team of application programmers with specific skills in updated Android SDKs.", "Interpret the written conceptual requirements and technical specifications as set by the client for their apps/solution.", "Designing and building mobile applications for Apple's iOS platform.", "Collaborating with the design team to define app features.", "Ensuring quality and performance of application to specifications.", "Identifying potential problems and resolving application bottlenecks.", "Fixing application bugs before final release.", "Publishing application on App Store.", "Maintaining the code and atomization of the application.", "Designing and implementing application updates."]},
{"post": "Oracle Apex Programmer", "company_name": "Tamishna Group", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67736", "salary_range": "Negotiable", "experience": "3 to 5 year(s)", "educational_requirements": ["CSE Graduates preferable but Graduation from other background with experience can apply as well."], "job_responsibility": ["Very strong knowledge & experience in oracle apex.", "Development environment includes, Oracle 12c Database, Oracle Apex, PL/SQL, Oracle Jde, WebLogic 12c.", "Hands on coding experience with Oracle PL/SQL and performance tuning of SQL queries.", "Experience with star schema/data warehouse data model, multi- dimensional reporting.", "Very Strong PL/SQL working knowledge is required in Oracle database, must have at least one-year experience in building complex SQL queries, Stored Procedures, Functions and understanding, debugging/step thru stored procedures,", "Strong Analytical and problem solving skills & Ability to work with end users to troubleshoot production issues.", "Basic database administrative tasks (backup, restore, installation) for numerous types of databases.", "Ability to document solutions/processes as needed.", "Assist in planning and implementing the data integration and data migration activities."]},
{"post": "Software Engineer", "company_name": "Rotana International", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67734", "salary_range": "Negotiable", "experience": "At least 2 year(s)", "educational_requirements": ["B Sc in Computer Science or a related field"], "job_responsibility": ["Write well designed, testable, efficient code by using best software development practices", "Create website layout/user interface by using standard HTML/CSS practices", "Integrate data from various back-end services and databases", "Gather and refine specifications and requirements based on technical needs", "Create and maintain software documentation", "Be responsibile for maintaining, expanding, and scaling our site", "Stay plugged into emerging technologies/industry trends and apply them into operations and activities", "Cooperate with web designers to match visual design intent Must have appropriate understanding about the objectives, requirements and plan accordingly to execute all types of digital marketing.", "Develop and manage different types of digital marketing (Social Media Marketing, Content Marketing, Email Marketing, Search Engine Marketing etc.).", "Arrange information of market for trend analysis.", "Ensure periodical monitoring of marketing strategy & evaluate effectiveness.", "Satisfy queries of prospective clients about our products & services in an appropriate manner (message/phone call/comments).", "Resolve customer's complaints (if any) within the range of authority otherwise refer to supervisor.", "Any other job related task assigned by the supervisor. Plan, strategies and execute digital marketing designs and activities to establish our brand and product presence in the online market.", "Generating idea with our creative team and presenting it to online market.", "Category 01 = [ Social Media Marketing, Email and LiveChat ]", "Facebook - Update page content with the help of our creative team. Structure planning and page promote.", "YouTube - Get our media and update videos. Create dynamic video from our ready content and make ready to upload.", "Twitter - Update feed frequently when news available.", "InstaGram, Pinterest - Photo Submission.", "Live chat with client/public about any type of business query using Chat clients Skype, Facebook, Website.", "Quick respond to FAQ around the web.", "Email List, Send & Response.", "SMS List, Send & Response.", "Category 02 = [ WebPage, SEO, Classified, Content-writing, Ads ]", "Website Update - regularly update our website contents and make some ideas to get most output from the visitors. Write blogs about our company products, new features, news, events etc. and post to our website blog regularly for weekly basis.", "Product Review - follow & response public reviews from the website related to automobile.", "S.E.O. - (On-page, Off-page) Do some research regularly about our Search Engine visitor and make it white to all the major search engine.", "BLOG content writing & Web2.0 creation for linking to Akij Motors main website.", "Classified Ads management to possible all the major websites for Bangladeshi market i.e. Bikroy.com, CarMudi.com.bd", "Advertising - Manage Ad Campaign for AdWords, Facebook Ads, Other Ads selected by our management"]},
{"post": "Business Analyst", "company_name": "Asian Global Ventures (Bangladesh) Company Ltd.", "location": "Any where in Bangladesh", "deadline": "Jul 20, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68016", "salary_range": "Negotiable", "experience": "3 to 7 year(s)", "educational_requirements": ["Bachelor of Science (BSc), Bachelor of Business Administration (BBA), Bachelor of Business Studies (BBS)", "Skills Required: Business, Business Analyst, Project Management"], "job_responsibility": ["A primary job responsibility of Business Analyst is to communicate with all top & to elicit, analyze and validate the requirements for changes to business processes, information systems, and policies.", "Business analyst will play a big role in moving an organization toward efficiency, productivity, and profitability.You will work directly under the Managing Director. You also have a good mix of project management, business analyst, market research, business development, and knowledge of various business domains (tech & non-tech) who can direct and supervise all support resources for the performance of project assignments and activities.", "Understand what business does and how it does", "Determine how to improve existing business processes", "Identify the steps or tasks to support the implementation of new features", "Design the new features to implement", "Analyze the impact of implementing new features", "Implement the new features", "An outstanding analytical skills will separate out a good business analyst. A good part of BA role includes analyzing data, workflow, user or stakeholders inputs, documents, etc.", "Directing team members, forecasting budget, helping team members with the problem, etc.", "Planning the project scope, understanding and implementing requirement of project, identifying resources required for the project and so on.", "As one of our core business is in IT sector, few technical aspect are expected to know like operating systems, hardware capabilities, database concepts, networking, SDLC methodology, etc."]},
{"post": "Senior Database & App Developer", "company_name": "Plexus Cloud Limited", "location": "Dhaka", "deadline": "Jul 15, 2020", "link": "http://bdjobs.com.bd/com_job_detail/67742", "salary_range": "Negotiable Salary will be determinate on your past experience and skill", "experience": "3 to 5 year(s)", "educational_requirements": ["Bachelor of Science (BSc)", "Skills Required: Android application development, CAPEX, Database Administrator (DBA), Java or Python Programming Language"], "job_responsibility": ["Clear knowledge of: APEX or JAVA or ANDROID Apps or DBA ORACLE (If you know any one then also can apply but you have to be the best on it.)", "Software development and co-ordinate."]},
{"post": "Executive / Sr. Executive, IT", "company_name": "Skyline Group", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68017", "salary_range": "Negotiable", "experience": "3 to 5 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science Engineering"], "job_responsibility": ["Provide IT support to user end for Desktops, Laptop, Printers, LAN and Email.", "Diagnose and fix desktop/laptop computer hardware and software.", "Maintain all IT equipment-desktops, laptops, printers, scanner etc. Troubleshooting and configuring office hardware including PCs, routers, switches, printers and other hardware peripherals etc.", "Installing and Update Antivirus, Operating systems (Windows XP, Windows 7, Mac, Windows 10,) & configuring outlook.", "Internet and Data-link monitoring and management.", "Maintain Network cabling Infrastructure (Local Area Network, WAN technology) and Trouble Shooting network problems.", "Good Knowledge on Access control Devices, IP Camera, Surveillance system, PABX etc.", "Basic knowledge on Software Application, Database and server maintenance.", "Ensure smooth operation of different types of internal application"]},
{"post": "Systems Administrator - Windows & VMware", "company_name": "ReliSource Technologies Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68018", "salary_range": "Very Competitive Salary and Benefits with Excellent Career Opportunity in a Focused & Stable organization.", "experience": "3 to 5 year(s)", "educational_requirements": ["B.Sc. in Computer Science & Engineering or related field from any reputed university.", "Certifications: Experience professional with VMware and Windows Server 2012/2016 Certification will be highly preferred."], "job_responsibility": ["Systems & Cloud Administration", "VMware Administration : VMware vSphere ESXi 60/6.5, vCenter 6.0/6.5/6.7, Horizon View 7/7.1", "IT Support, Helpdesk ( Include Tier II & Tier III)", "System Security and Database Administration as additional responsibility"]},
{"post": "Mobile Application Developer", "company_name": "ReliSource Technologies Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68022", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization.", "experience": "2 to 3 year(s)", "educational_requirements": ["B.Sc in Computer Science & Engineering from any reputed university."], "job_responsibility": ["Implement Mobile Apps for Android and iOS using Cross Platform Framework", "Design, develop and test secure mobile applications.", "Communicate with US clients and technologists to understand business requirements and deliver desired output."]},
{"post": "Software Engineer (.NET Platform)", "company_name": "ReliSource Technologies Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68019", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization.", "experience": "3 to 6 year(s)", "educational_requirements": ["B.Sc. in Computer Science & Engineering from any reputed university."], "job_responsibility": ["Design, develop, and troubleshoot enterprise software involving Mobile Apps, Web Portals, Web Services, etc. using .NET technologies.", "Work in a team and provide obvious solutions to design, implementation and bug fixing challenges.", "Regularly communicate with US clients."]},
{"post": "Business Analyst", "company_name": "ReliSource Technologies Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68020", "salary_range": "Competitive salary and long term benefits with excellent career opportunity in a focused & stable organization.", "experience": "1 to 2 year(s)", "educational_requirements": ["B.Sc in Computer Science & Engineering (or equivalent) from any reputed university", "An MBA from any reputed university could be considered as an added advantage"], "job_responsibility": ["We are looking for passionate individuals who will assist product owners, senior analysts and other subject matter professionals in gathering, validating, and documenting various system information, requirements and needs. The person will carry out an in-depth evaluation and verification of the capabilities of systems, serving as a middle man between the end-users and software developers, to ensure that product information are properly disseminated. He/she will participate in SDLC, and should be able to carryout instructions as directed by his/her supervisors. A strong sense of responsibility, accountability, proactiveness and good communication skills is a must. Additionally, one should be able to handle pressure. Please DO NOT APPLY if you do not possess such skills.", "As a whole, we are looking for dynamic individuals capable of consistently delivering & exceeding expectations in the follow", "Business Analysis & Requirement management", "Coordinate between management and engineering team", "Investigate into possible business and technical solutions for business problems an application or, a software is trying to solve"]},
{"post": "Software Engineer/ Developer", "company_name": "Neways International Company Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68025", "salary_range": "Negotiable", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science and engineering", "Skills Required: Ajax, Bootstrap, Codeignite, HTML CSS, JavaScript, jQuery, JSON, Vue"], "job_responsibility": ["Design, develop, and troubleshoot enterprise software involving Web Portals, Web Services, Mobile Apps etc.", "Work in a team and provide obvious solutions to design, implementation and bug fixing challenges.", "Create website layout/user interface by using standard HTML/CSS practices.", "Integrate data from various back-end services and databases", "Contribute to design, code, specification and architectural reviews and technical", "documentation.", "A clear understanding of OOP, Data Structures, Algorithms and Design Patterns.", "Must be able to develop website with Codeigniter, Laravel, PHP, MYSQL, JavaScript, vue, jQuery, Ajax and JSON, RestApi.", "Understand SDLC."]},
{"post": "Business Analyst", "company_name": "Ejogajog Limited", "location": "Any where in Bangladesh", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68028", "salary_range": "Negotiable", "experience": "2 to 6 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Information Technology, Computer Science", "Skills Required: JIRA, Prototyping"], "job_responsibility": ["eJogajog Limited is focusing on various areas of supply chain including transportation, inventory, logistics etc. eJogajog launched an online marketplace named GIM (Goods In Motion - gim.com.bd) for commercial transportation through which we are envisioning to transform the supply chain industry in Bangladesh by building a technology platform where both the customer and service providers will match their needs in real-time basis to ensure higher utilization and efficiency.", "eJogajog is looking for Business Analyst for its Product and Market organization. Business Analyst will be the vital link between our information technology capacity and our business objectives by supporting and ensuring the successful completion of analytical, building, testing and deployment tasks of our software product`s features.", "Define configuration specifications and business analysis requirements", "Perform quality assurance", "Define reporting and alerting requirements", "Own and develop relationship with partners, working with them to optimize and enhance our integration", "Help design, document and maintain system processes", "Report on common sources of technical issues or questions and make recommendations to the product team", "Communicate key insights and findings to the product team", "Constantly be on the lookout for ways to improve monitoring, discover issues and deliver better value to the customer"]},
{"post": "Frontend Developer", "company_name": "Braintech Systmes Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68031", "salary_range": "Negotiable", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science or equivalent", "Skills Required: AngularJS, HTML5 & CSS3, JavaScript, ReactJS, Vue.js"], "job_responsibility": ["N/A"]},
{"post": "Senior .NET Developer", "company_name": "Enosis Solutions", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68036", "salary_range": "Tk. 75000 - 115000 (Monthly)", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in CSE", "B.Sc or M.Sc in Computer Science/ Engineering or equivalent."], "job_responsibility": ["Develop high-quality software, ensuring proper design and architecture", "Analyze requirements and understand the deliverables", "Identify, prioritize and execute tasks in the software development life cycle", "Review code of other developers", "Collaborate with team members and ensure knowledge transfer", "Work closely with internal teams to fully understand the business process and requirements", "Ensure that projects are accurately estimated and delivered to schedule", "Actively contribute to the process of continual improvement, with regard to self, team and systems", "Assume a high level of ownership of all work developed by members of the team"]},
{"post": "Senior Software QA Engineer", "company_name": "Enosis Solutions", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68035", "salary_range": "Tk. 60000 - 95000 (Monthly)", "experience": "At least 3 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in CSE", "B.Sc or M.Sc in Computer Science/ Engineering or equivalent."], "job_responsibility": ["Understand client's requirements and determine testing scope.", "Breakdown tasks into major test areas and estimate the time.", "Determine and define test strategies for all sorts of applications.", "Able to prepare test cases, checklists, traceability matrix as per requirements.", "Execute tests or write test code to verify enhancements and bug fixes.", "Prepare test data and use them during testing (by populating database table).", "Prepare test environment and know how to manipulate to serve testing purpose.", "Report bugs/defects with appropriate details.", "Determine root cause of functional bugs or errors in test code.", "Prepare all sort of test documents (test plan, test report, release notes, etc.)", "Identify assigned tasks.", "Update task status and comments following proper workflow.", "Monitor all tasks/issues of a release.", "Retrieve latest code from appropriate branch.", "Submit changes to appropriate branch with comments.", "View repository log and understand where any specific modification has been made.", "Merge source code changes made by other team members.", "Provide written and verbal status in all sort of meetings.", "Perform R&D to identify the scope of test ideas that may scale up the output level", "Review all sort of tasks of team members.", "Guide and coach team members.", "Communicate with Dev lead/ manager to improve development processes and resolve problems."]},
{"post": "Senior Web Content Writer/ Editor", "company_name": "Jessore IT", "location": "Khulna", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68052", "salary_range": "Tk. 30000 - 50000 (Monthly)", "experience": "At least 2 year(s)", "educational_requirements": ["At least a Bachelor's degree in any discipline ( English is preferable.)", "IELTS or TOEFL will add extra values.", "Skills Required: Blog Writing, Content writing, Copy writing/ Script Writing, Creative content writing, Creative writing, Excellent writing and presentation skills., strong written and verbal communication skill"], "job_responsibility": ["Here`s the thing-we hate traditional job descriptions. In our experience, they`re a terrible representation of what a job really entails and never paint a true picture of what it`s like to work at an organization.", "That`s why, at Jessore IT, we do things differently. Instead of presenting you with some run-of-the-mill job description, we offer potential candidates our Job Spotlights. This gives us a chance to tell you the story of us, why you should work here, and what the role is really like.", "Review, Proof Read & edit freelancer and in-house writer's work.", "Work alongside our SEO team to implement SEO updates and best practices.", "Edit and manage content for the Client Services department in accordance with our in-house style guide.", "Initiate new practices and procedures that benefit the freelance writing team and streamline productivity.", "Consult with the Senior Content Marketing Manager on creative and progressive writing tips, as well as any updates on SEO & Google algorithms.", "Develop content strategies based around keyword optimization for our clients.", "Generate interesting, and exciting content ideas for our target market needs and maintain a content writing calendar.", "Learn Knowledge of current SEO best practices and experience implementing them.", "Write & update website content when needed.", "Conducting in-depth research on industry-related topics in order to develop original content.", "Creative thinking is a must for this position.", "Ability to work independently or as an active member of a team."]},
{"post": "Web Programmer", "company_name": "Color Experts International, Inc.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68055", "salary_range": "Negotiable", "experience": "At least 5 year(s)", "educational_requirements": ["B.Sc in Computer Science or Masters in Computer Science or any other relevant field."], "job_responsibility": ["Proven work experience as a Web programmer.", "Develop Portal, OMS (Order Management System), and PMS (Project Management System) with the required web or mobile supported app.", "Must have knowledge about wordpress plugin & theme development.", "Knowledge of Laravel /Codeigniter with vue.js", "Knowledge on PHP (Core OOP), MySQL, CSS3, Bootstrap3, JavaScript, jQuery, Angular, XML, Node.js, and AJAX integration.", "Database Design, DFD, Server Maintenance, Amazon AWS integration and maintenance", "Website testing and Bugfixing", "Especially concerning cross browser compatibility & markup code.", "Must be able to handle & fix problems from AWS Services, Email Server, Cpanel, FTP, Web Server, etc.", "Knowledge or have working experience about using Vagrant or Docker & Git, Bower, Gulp.", "Project management skills within a fast-paced work environment.", "Should knowledge about code & webpage speed optimization.", "Cooperating With Dev Team.", "Should know about SEO (Search Engine Optimization) to develop & maintain a website", "Must be able to handle multiple projects and deadlines, learn application quickly, and willingness to keep up with the latest in internet technologies.", "Helping the marketing team for their web requirements."]},
{"post": "Data Artist (Associate)", "company_name": "Catalyst Solutions (Sister concern of Adiva Graphics)", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68051", "salary_range": "Tk. 15000 - 25000 (Monthly) The salary quoted will be effective after successful completion of PROBATION PERIOD", "educational_requirements": ["Bachelor of Science (BSc) in EEE, CSE, ETE, IT, Physics, Bachelor of Business Administration (BBA) in Economics, Statistics", "Candidates with CGPA below 4.0 in SSC or HSC need NOT to apply", "Fresh Graduates are encouraged to apply, to state the obvious, some job experience is preferable."], "job_responsibility": ["Data analytics working based in the usa; catering to top 10 marketing research and analytics companies in the world. Survey checking, quality check data tables and creating visually engaging charts to help facilitate client`s marketing research project management process.", "We have an unique work environment and maintain an out of the box ambience, culture. Therefore, it is a must that every candidate should be able to adapt our belief system and adopt our work philosophy.", "QC Online Programming in order to ensure surveys logics and questionnaire are working as per client's overall research brand objective", "Ensure the final data output (tabs in SPSS, Excel) is accurate to ensure main objectives of the study/projects are met", "Work extensively with/on Microsoft PowerPoint and Excel to create data heavy charts", "Extensive knowledge of Excel; such as creating macros and formulas, is a huge PLUS!", "Analyze data and placing it into various charts", "Incorporate various charts and integrate them into PowerPoint slides", "Catalyst Solutions (doing business as Adiva Graphics) is a multinational company, therefore fluency in English is a must."]},
{"post": "Junior Software Engineer", "company_name": "Giantssoft Solution", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68048", "salary_range": "Tk. 15000 - 25000 (Monthly)", "experience": "At most 1 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science & Engineering"], "job_responsibility": ["Basic knowledge of programming.", "ACM Solver will get extra advantage.", "If familiar with .NET, Node.js or angular will get privileged"]},
{"post": "Software Engineer(Python), PrismERP P Series", "company_name": "Divine IT Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68045", "salary_range": "Tk. 28000 - 40000 (Monthly) Probation Period: 3-6 months (Depending on progress)Festival Bonus and Other Benefits as per company Policy for Successful candidates after Probation Period", "experience": "2 to 3 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science & Engineering"], "job_responsibility": ["Development of PrismERP modules, features and bug fixes maintaining the design and architecture consistent.", "Identify the need for PrismERP New features, customization, enhancement, and improvement scopes.", "Working with Business and System Analyst for the m-D behavior of PrismERP.", "Maintain code level efficiency for Platform Independence at the database layer.", "Maintain version control for minor and major releases.", "Ensure release (minor/major) briefing to the QA, Analyst and Deployment Engineering Department", "Maintain Dev/Technical Documentation", "Support Jr Devs, review codes to accomplish Product Delivery and Standard"]},
{"post": "Executive/ Sr. Executive, IT", "company_name": "APS Group", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68059", "salary_range": "Negotiable", "experience": "2 to 5 year(s)", "educational_requirements": ["B.Sc. / M.Sc. in Computer Science.", "Good academic & professional background"], "job_responsibility": ["Responsible for handling existing network configuration, Networking equipment, Servers, Workstations, PABX, IP Phone configuration.", "Responsible for installing operating system, driver software, application Software, configuring email in outlook with backup system.", "Have knowledge about overseeing company Web site, domain control panel and hosting panel server including administration.", "Have sound knowledge of computer hardware system.", "Have sound knowledge to process employee's attendance data sheet from software.", "CCTV Camera and DVR monitoring and administration and report monthly/as per requirements.", "Maintain proper documentation for updating inventory of all hardware and IT products and information.", "Any other task is assigned by management from time to time."]},
{"post": "Senior Executive (Security Specialist)", "company_name": "Bangladesh Honda Pvt. Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68060", "salary_range": "Negotiable", "experience": "4 to 5 year(s)", "educational_requirements": ["B.Sc in CSE / EEE / ETE from reputed University."], "job_responsibility": ["Provide security monitoring and incident response services required by the business, in alignment with Cyber Security's mission to protect Company's Digital Assets (including Industrial Control Systems) to a level of confidentiality, integrity and availability commensurate with the threat to those assets.", "Act as internal expert on matters relating to intrusion detection and incident response.", "Contribute to the development and improvement of security monitoring and incident response processes and solutions as required to support our cyber security program.", "Operate security monitoring and incident response tool sets with a focus on continuous improvement.", "Research and recommend solutions for incident response and digital forensics.", "Finding the best way to secure the IT infrastructure of an organization.", "Constantly monitoring for attacks and intrusions.", "Protecting information from unauthorized access, duplication, modification, or destruction.", "Analyzing security measures taken to protect information.", "Testing for and correcting possible weaknesses or openings.", "Configuring security programs and tools.", "Running vulnerability tests and updating defensive protocols and systems accordingly.", "Monitoring all access to the information.", "Running defensive protocols and programs when breaches occur.", "Ensure all security according to local, global regulations.", "Conduct user training for institutional security enhancement.", "Perform Global IT Security Policy deployment.", "Good knowledge on Monitoring System, Operation, understating Logs, creating reports, alarm handling and deployment skills.", "Coordinate with support team to provide organizational user support and solution."]},
{"post": "Pro Content Writer", "company_name": "Getweb Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68037", "salary_range": "Tk. 25000 - 35000 (Monthly)", "experience": "2 to 5 year(s)", "educational_requirements": ["Bachelor of Science (BSc)"], "job_responsibility": ["Write content in everyday English with a natural flow (blogs, product descriptions, product reviews, social media posts, etc.)", "Write in a variety of formats and niches avoiding copyright issues (research/thesis articles excluded)", "Optimize content for ranking following SEO team's direction", "Other relevant tasks assigned by the authority"]},
{"post": "Senior Full Stack Software Engineer ( Code Reviewer )", "company_name": "Hoxro Dev Centre", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68058", "salary_range": "Negotiable Please mention your minimum salary expectation in your cover letter.", "experience": "At least 4 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in CSE, CS, EEE, Physics or relevant, Master of Science (MSc) in Software Engineering", "Skills Required: .Net Core, Angular, HTML5 & CSS3, JavaScript, SASS, Typescript"], "job_responsibility": ["Review and test code to spot potential bugs, unclear and messy code in logic or formatting, and for completeness", "Review the code that meets our internal standards for style, maintainability, and best practices for a high-scale web environment", "Make sure the code is secure and adhere to security best-practices", "Document and Create change documentation for user consumption", "Conduct unit, behavioral and automated testing", "Optimize applications for performance and memory usage and resolve production issues.", "Work according to documented SDLC, providing feedback and input into SDLC as needed, and supporting automation of SDLC tasks as required", "Collaborate with other engineers, and CEO to maintain a high bar for quality in a fast-paced, iterative environment", "Maintain and advocate standards through code review", "Take ownership of the completeness of the code", "Be passionate about what we are building and contribute to it and not wait on the sideways", "Be polite ( Sarcasm, insults, and belittling words have no place in a code review )", "Be constructive ( Don't just criticize, but be helpful: point the way toward solutions)", "Be comfortable with continuous integration workflows", "Publish code changes to User Acceptance Testing (UAT) environment", "Publish code changes to PROD environment", "Have a strong belief in the merits of peer code review"]},
{"post": "Jr. Software Engineer(Python), PrismERP P Series", "company_name": "Divine IT Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68044", "salary_range": "Tk. 20000 (Monthly) Festival Bonus and Other Benefits as per company Policy for Successful candidates after Probation Period", "experience": "At most 1 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science & Engineering"], "job_responsibility": ["Development of PrismERP modules, features and fix bugs maintaining the design and architecture consistent.", "Identify the need for PrismERP New features, customization, enhancement, and improvement scopes.", "Working with the Business and System Analysts to learn about the m-D behavior of PrismERP.", "Maintain code level efficiency for Platform Independence at the database layer.", "Maintain version control for minor and major releases.", "Ensure release (minor/major) briefing to the QA, Analyst and Deployment Engineering Department", "Maintain Dev/Technical Documentation."]},
{"post": "Software Engineer - Frontend", "company_name": "Divine IT Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68040", "salary_range": "Tk. 20000 - 30000 (Monthly) Festival Bonus and Other Benefits as per company Policy for Successful candidates after Probation Period.", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor degree in any discipline"], "job_responsibility": ["Designing and developing front end for Web Applications", "Working with the Graphics Design team to ensure better UI/UX experience", "Collaborating with Business team to build mock UI/UX for features and modules based on requirements", "Bring Continuous improvements to existing UI/UX of current applications"]},
{"post": "Diploma Engineer for VHF/UHF Equipment", "company_name": "Communication Systems Ltd", "location": "Any where in Bangladesh", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68066", "salary_range": "Negotiable, Expected salary to be mentioned.", "experience": "At least 3 year(s)", "educational_requirements": ["Diploma in Electrical, Electronics, Computer, & Air-conditioning."], "job_responsibility": ["Pre/Post Sales Support", "Installation and Maintenance of VHF/UHF equipment.", "Correspondence with foreign manufactures."]},
{"post": "Android Application Developer", "company_name": "IOTAIT", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68063", "salary_range": "Tk. 20000 - 40000 (Monthly)", "experience": "At least 2 year(s)", "educational_requirements": ["Bachelor of Science (BSc)", "Skills Required: Android, Flutter, Java, Kotlin"], "job_responsibility": ["Good Problem Solving skill with an eye for clean and maintainable codes.", "Experience of Designing and building advanced native applications for the android platform", "Must have hands on SQL query writing skills for complex requirements.", "Sound knowledge in Object Oriented Programming(i.e. OOPs) concepts in JAVA, Kotlin.", "Work with team members to design solutions that are supported by the architecture of the existing systems.", "Must have knowledge in MVP or MVVM design architecture", "Must have knowledge in Firebase Realtime Database, FireStore Database, Analytics, Push Notification.", "Work with outside data sources for integration using REST APIs or other web services.", "Repo management and versioning concepts.", "Experience in Dependency Injection, Dagger, core Android Concept", "Experience in Flutter is plus point ( optional )"]},
{"post": "Frontend Developer (Vue js)", "company_name": "Clementine Data Solutions Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68069", "salary_range": "Tk. 35000 - 45000 (Monthly)", "experience": "At least 3 year(s)", "job_responsibility": ["About Clementine: We are a data solutions company that partners with businesses to help solve business problems, enabling better, smarter and faster decisions. We are always looking for the right talent who are passionate about their work. We have a start-up mentality and look for candidates who would operate with a responsive and agile mindset. Diversity inclusion and teamwork are second nature to us; these values permeate our entire business structure. We are also committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. The rich and varied personal and professional backgrounds of our employees make us a dynamic and rewarding company at which to build a career. We invite you to join us.", "We are looking to hire an experienced (3 years minimum) full-time Frontend Developer who has excellent UX/UI sense for web app. He/she can bring any mockup into web (html/css) and have demonstrable experience in vue js", "Work closely with founders to understand features", "Create mockups and prototypes before development", "Write codes and develop responsive UI using html, css, vue js", "Debug errors and resolve UX/UI issues on live applications", "Improve the usability of the application with regular tweaks", "Candidate must be able to work independently.", "Clean and well-structured coding", "Applicants must be proactive and a problem solver.", "Should be able to work as a team member under Team Leader and Project Manager.", "Experience in large scale ERP development.", "Will be assigned on multiple projects individually or as a part of the team."]},
{"post": "Social Media & Online Marketer", "company_name": "NEO Zipper Co., Ltd.", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68068", "salary_range": "Negotiable", "experience": "3 to 7 year(s)", "educational_requirements": ["Bachelor degree in any discipline", "Proven work experience as a social media specialist, hands on experience in content management, with short video experience is preferred.", "Excellent copy writing skills, ability to deliver creative content (text, image and video), knowledge of online marketing channels", "Excellent communication skills and analytical and multitasking skills", "Skills Required: Challenging"], "job_responsibility": ["Responsible for operation and maintenance of FB/INS and other social media platform accounts.", "Responsible for social media promotion and outsourcing of content inside the terminal, and cooperate to create a video of the end of the explosion", "Design social media account interactive activities to improve social media account influence"]},
{"post": "Technician for VHF/UHF Equipment", "company_name": "Communication Systems Ltd", "location": "Any where in Bangladesh", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68067", "salary_range": "Negotiable, Expected salary to be mentioned.", "experience": "At least 2 year(s)", "educational_requirements": ["SSC or Equivalent"], "job_responsibility": ["Pre/Post Sales Support", "Installation and Maintenance of VHF/UHF equipment.", "Capable to write note on the job done."]},
{"post": "Web Application Engineer", "company_name": "IDARE LTD", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68073", "salary_range": "Tk. 40000 - 65000 (Monthly)", "experience": "At least 3 year(s)", "educational_requirements": ["Bachelor degree in any discipline", "Skills Required: JavaScript, Laravel, MySQL and MVC framework, PHP (OOP), react js, WordPress"], "job_responsibility": ["IDARE is currently seeking to hire a Web Application Engineer to support our work onsite and support our clients. The ideal candidate has a thorough understanding of the WordPress platform as well as general web development standards and best practices. Strong front-end web development skills, an eye for design, organizational skills and adaptability are crucial to success in this position.", "About IDARE", "IDARE is a Houston based web software technology start-up, focused on building a scalable web application in the Oil & Gas industry.", "Customize existing WordPress solutions to support unique client needs", "Manage Learning Management Module in and e-Learning Platform in WordPress", "Strategize and perform data migrations from other web platforms onto WordPress", "Provide end-user WordPress technical support, instruction and troubleshooting", "Perform routine updates to WordPress core, plugins and other dependencies", "Monitor and analyze existing sites for opportunities for improvement and optimization", "Test all new and existing sites for performance, scalability and browser compatibility"]},
{"post": "Senior UX/ UI Designer", "company_name": "Sawari Overseas", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68072", "salary_range": "Tk. 25000 - 40000 (Monthly)", "experience": "At least 3 year(s)", "educational_requirements": ["Bachelor of Fine Arts (B.F.A), Bachelor of Science (BSc) in Bachelor of Science (BSc) in Computer Science Engineering", "Skills Required: Adobe After Effects, Adobe creative Suite, Adobe Photoshop/ Illustrator, Figma, HTML & CSS, Sketch"], "job_responsibility": ["We are seeking a full-time Senior UI/UX Designer who will contribute to making our products look cool, user-friendly, market-focused, and lead our product/software/web design to another level. So, when we say we are looking for a UI / UX Designer, yes, you will be designing solutions that not only meet user`s needs but elegantly scale and fit within the larger system and platform we already have. But at the end of the day, what we really need is another awesome team member who will do what it takes to help us shape amazing products. If you are creative in mind, passionate about designing, and have substantial knowledge of UX, then you are the person we are looking for.", "Conceptualize original ideas that bring simplicity and user-friendliness to complex design roadblocks", "Plan, ideate and involve constructive feedback on every page of your web-template design, you must own and define the whole process yourself", "Continuously keeping tracks of new trends, researches, and ideas relating to your work and evolving web designs", "Must know the works of UX designer like how the user thinks and feel, analyze research and data ensuring a product makes", "Must have a clear understanding of user needs, define interaction models, design wireframes, build prototypes and work on brand color", "Must know typography.", "Hands-on experience creating wireframes, prototypes, storyboards, user flows, etc.", "Experience using tools such as Photoshop, Sketch, Illustrator, InVision, UXPin, Quartz.", "Must know HTML5, CSS3 , bootstrap.", "A planner with an aesthetic sense.", "Master in color theory.", "Research and advocate for product design best practices"]},
{"post": "Angular Developer", "company_name": "SIMEC System Limited", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68077", "salary_range": "Negotiable", "experience": "3 to 4 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science, Bachelor of Science (BSc) in Computer Engineering", "Skills Required: Angular, PHP"], "job_responsibility": ["We are looking to hire an experienced AngularJS Developer to join our dynamic team. As a Co-Developer, you will be responsible for creating a top-level coding-base using Angular best practices. Your role will require you to implement an exciting and streamlined user experience in the form of a Java-based desktop and mobile web-app. To ensure success as an AngularJS Developer, you should have extensive knowledge of theoretical software engineering, be proficient in JavaScript, HTML, and CSS, and have excellent project management skills. Ultimately, a top-class AngularJS Developer can design and build a streamlined application to company specifications that perfectly meet the needs of the user.", "Designing and developing user interfaces using AngularJS best practices.", "Adapting interface for modern internet applications using the latest front-end technologies.", "Writing JavaScript, CSS, and HTML.", "Developing product analysis tasks.", "Making complex technical and design decisions for Angular projects.", "Developing application codes and unit tests in Angular and Rest Web Services.", "Conducting performance tests.", "Consulting with the design team.", "Ensuring high performance of applications and providing support."]},
{"post": "Chief Technology Officer", "company_name": "JoomShaper.com", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68089", "salary_range": "Tk. 200000 - 300000 (Monthly)", "experience": "7 to 10 year(s)", "educational_requirements": ["We care more about the person and his/her skills, not degrees or academic qualifications. Although, if you have any achievement that makes you proud, we are all ears."], "job_responsibility": ["Does working with world-class engineering teams excite you? Do you believe that software can change lives? Do you like solving hard problems? Are you a teacher or coach at heart, who loves to mentor engineers and help them unlock their full potential? If so, you might be JoomShaper`s next Chief Technology Officer (CTO).", "JoomShaper`s CTO will provide a clear technical vision and leadership for all aspects of our business. Partnering closely with leaders across all JoomShaper`s business units, the CTO will ensure alignment, mitigate risk, and drive high performing software engineering teams to success. What we build changes lives, join us in that mission.", "Define and implement development standards according to up-to-date coding methodologies and best practices", "Build an agile development culture", "Set up a development team workflow", "Conduct code reviews", "Perform design reviews", "Break down development tasks", "Supervise hiring of developers", "Mentor newly hired developers", "Communicate with stakeholders", "Determine KPIs of developers", "Monitor developers' progress", "Manage technical risk", "Oversee system infrastructure across JoomShaper to ensure functionality and efficiency and mitigate risk", "Improve quality assurance and data protection processes", "Monitor technical KPIs and budgets", "Use stakeholders' feedback to inform necessary improvements and adjustments to technology and process"]},
{"post": "Engineer - IT & MIS", "company_name": "Techno Plast Consultancy", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68092", "salary_range": "Negotiable", "experience": "2 to 5 year(s)", "educational_requirements": ["Bachelor of Science (BSc) in Computer Science Engineering, Bachelor of Science (BSc) in Computing & Information System"], "job_responsibility": ["Installing, configuring and repairing computer hardware, software, systems, networks, printers, scanners and cctv camera", "Maintaining computer systems, Antivirus and networks", "Maintaining CCTV/IP Camera, Biometric Finger, Attendances software & Access Control Device", "Responding in a timely manner to service issues and requests", "Providing technical support across the company", "Repairing and replacing equipment as necessary", "Ensure timely and accurate delivery of technology products and services", "To create a wide variety of graphics products such as newsletters, leaflet, business cards, catalogs, new arrivals, Invitation Card, letterheads etc, Shop Sign, Packaging, Logo Development, Desk Calendars/ Wall Calendars, Diary etc.", "Work on different branding solutions: brand and corporate identity, brand support", "Others task given by Management"]},
{"post": "Digital Marketing Executive", "company_name": "Electronics Company", "location": "Dhaka", "deadline": "Jul 21, 2020", "link": "http://bdjobs.com.bd/com_job_detail/68081", "salary_range": "Negotiable", "experience": "2 to 5 year(s)", "educational_requirements": ["Bachelor degree in any discipline", "Skills Required: Advertising & Promotion, Analytical ability, Digital Marketing, Excellent communication skills, Sales, SEO, Social Media Marketing"], "job_responsibility": ["Based on skills & experiences we will recruit more than 5 positions to the same team. The post for the team leader will be full time /part time/contractual basis.", "Those who want to work on part-time/full time, contractual or freelance basis, please offer us your plan including working hour and your expectation to top of your CV or email body.", "Execute all digital marketing, including Facebook posting, post boosting, responding, SEM/ SEO, Social Media Instagram, Snap chat, Twitter, YouTube, and Web advert such as Google add, E-mail marketing, good graphics design knowledge, Photoshop & Illustrator, create necessary marketing database by online & field research.", "Ability to create cover photo, Banner design, Photo manipulation, motion graphic, Animation, video editing, sound editing for video clip, info-graphic design etc.", "Online marketing analytics to gather information from web and social media pages.", "Prepare and posting online content for the company's social media page and website.", "Plan and execute all digital marketing efforts, database, email and social media marketing strategies.", "Have to manage all three different layers of marketing (ATL, BTL, and TTL).", "Keep up to date record at database, spreadsheets and inventory list.", "Preparing, Planning and managing the publication of all promotion material to make the most of brand promotion.", "Create and develop new ideas for business development.", "Develop new client base and maintain good relationship with existing client.", "Contribute to day to day, week to week and month to month sales", "Create a team to organize marketing campaigns & events and execute them.", "Conduction routine tasks assigned by the management and providing feedback to the management as per company requirement."]}
]