[
{"company_name": "Relisource", "post": "Business Analyst", "link": "https://www.relisource.com/job-post/business-analyst/", "educational_requirements": ["B.Sc. in Computer Science & Engineering (or equivalent) from any reputed university", "An MBA from any reputed university could be considered as an added advantage"], "job_responsibility": ["We are looking for passionate individuals who will assist product owners, senior analysts and other subject matter professionals in gathering, validating, and documenting various system information, requirements and needs. The person will carry out an in-depth evaluation and verification of the capabilities of systems, serving as a middle man between the end-users and software developers, to ensure that product information are properly disseminated. He/she will participate in SDLC, and should be able to carryout instructions as directed by his/her supervisors. A strong sense of responsibility, accountability, proactiveness and good communication skills is a must. Additionally, one should be able to handle pressure. Please DO NOT APPLY if you do not possess such skills.", "\r\nAs a whole, we are looking for dynamic individuals capable of consistently delivering & exceeding expectations in the following:", "\r\n"], "job_requirements": ["Engagement with customers, product end-users, product managers, and internal subject matter experts to understand the key requirements and workflows", "Translating business requirements into technical requirements used for driving improvements, enhancements and/or creations of new applications", "Create use cases, supporting functional requirements, user stories and acceptance criteria according to the guidelines provided", "Work closely with development/test/regulatory/product/business teams in an agile environment to help refine and support the development, testing and release of functionality", "Support internal cross-functional activities necessary for successful product release", "Review, prioritize, comment and follow-up on product defects", "Help creating presentations & demos to train internal teams on new functionality", "Develop technical proposals & documentations (i.e., white paper, case study etc.) based on R&D", "Work collaboratively in a team environment to meet aggressive goals", "Must be able to handle pressure and deliver under tight deadlines"], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Competitive salary and long term benefits with excellent career opportunity in a focused & stable organization."},
{"company_name": "Relisource", "post": "Senior Business Analyst", "link": "https://www.relisource.com/job-post/senior-business-analyst/", "educational_requirements": ["Business Analysis & Requirement management", "Coordinate between business and engineering team", "Developing both business and technical solutions for business problems", "Some level of Project Management activities"], "job_responsibility": ["We are looking for a passionate individual whose role will be to assist product owners, product managers and other subject matter professionals in gathering, validating, and documenting various system information, requirements and needs. The person will carry out an in-depth evaluation and verification of the capabilities of systems, serving as a middle man between the end-users and software developers, to ensure that product information are properly disseminated. He/she will participate in the system development life cycle, and as such we be available to carryout instructions as directed by the lead analyst / product owner. A strong sense of responsibility, accountability, proactiveness and good communication skills is a must for this position. Please DO NOT APPLY if you do not possess such skills.", "\r\nAs a whole, we are looking for dynamic individuals capable of consistently delivering & exceeding expectations in the following:", "\r\n"], "job_requirements": ["Engage with customers, product end-users, product managers, and internal subject matter experts to understand the key requirements and workflows", "Translate business requirements into technical requirements used for driving improvements, enhancements and/or creations of new applications", "Create detailed use cases, supporting functional requirements, user stories and acceptance criteria", "Work closely with development/test/regulatory/product/business teams in an agile environment to refine and support the development, testing and release of functionality", "Support key internal cross-functional activities necessary for successful product release", "Review, prioritize, comment and follow-up on product defects", "Create presentations & demos to help train internal teams on new functionality", "Develop technical proposals & documentations (i.e., white paper, case study, expertise in specific technology, architecture, etc.) based on R&D.", "Prepare business communication materials like marketing proposals, marketing collateral, case studies, white papers, MRD, PRD, etc.", "Work collaboratively, act in a lead role as a subject matter expert and work in a team environment to meet aggressive deadlines", "Must be able to handle pressure and deliver under tight deadlines"], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Competitive salary and long term benefits with excellent career opportunity in a focused & stable organization."},
{"company_name": "Relisource", "post": "Mobile Application Developer", "link": "https://www.relisource.com/job-post/mobile-application-developer/", "educational_requirements": ["B. Sc. in Computer Science & Engineering from any reputed university."], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Good eye for design and user experience.", "Excellent communication skill in English.", "High integrity and intellectuality.", "Adherent to teamwork and always represent team in work and achievement."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)"},
{"company_name": "Relisource", "post": "Marketing Manager", "link": "https://www.relisource.com/job-post/marketing-manager-opening/", "educational_requirements": ["Bachelor’s degree in Marketing, Advertising, Communications, English, Journalism or related field."], "job_responsibility": ["We are looking for a passionate marketing expert who will provide support to our Sales, Design, Development, Program Management and Business Analysis team by developing, executing, and measuring creative campaigns and brand voice, developing compelling multimedia content and drive the strategic marketing direction for ReliSource as a whole. The incumbent must be a problem-solving marketer who will thrive in a fast-paced environment and look for creative solutions when challenges arise. He/she will also be responsible for business development activities by researching and creatively developing marketing opportunities through strategic planning and social media networking. A strong sense of responsibility, accountability, proactiveness and good communication skills is a must for this position. Please DO NOT APPLY if you do not possess such skills."], "job_requirements": ["Execute a mix of online campaign elements including email, webinars, search, social, advertising with compelling calls to action to deliver pipeline goals.", "Create multimedia content such as videos and podcasts.", "Manage social media channels (LinkedIn, Facebook, Youtube) to ensure content is timely, relevant, and engaging.", "Assist with analysis and report of marketing metrics and KPIs.", "Amazing copy writing skills with the ability to write in and develop the ReliSource brand voice.", "Passion for measureable results and analytics; uses and leverages social analytics tools for insights; able to translate insight into actions to improve results over time.", "Empower sales & marketing team and their activities (campaigns, events, paid media, social, etc.)", "Tech-savvy with the ability to make complex technical matters easy-to understand even for non-technical people.", "Knowledge of digital marketing tactics, including SEO, email marketing and web analytics.", "Plan and execute all digital marketing techniques, including using SEO/SEM best practices to increase website traffic, marketing database, email, and social media.", "Regularly produce various content types, including email, social media posts, blogs and white papers.", "Be highly proactive on digital media by creating/sharing blog posts, articles, trending technology topics etc. and ensure ReliSource’s digital presence is of top quality.", "Standardizing all the Marketing materials/content within the organization.", "Work with relevant departments/teams and prepare Project documentations for all the projects that ReliSource has done and can potentially do in the future."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Competitive salary and long term benefits with excellent career opportunity in a focused & stable organization."},
{"company_name": "Relisource", "post": "Database Administrator (Senior)", "link": "https://www.relisource.com/job-post/database-administrator-senior/", "educational_requirements": ["B.Sc. in Computer Science & Engineering from any reputed university.", "Training/Certification in MSSQL DBA is an advantage but not mandatory."], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Strong knowledge on Database Backup, Recovery, Log Shipping, Mirroring, High-Availability and Disaster Recovery solution knowledge for SQL server is must.", "Install and maintain the DBMS server along with operating systems as well as all supporting software.", "Understanding of Windows Server 2003-2016 operation", "Strong problem solving skill using SQL & T-SQL & Experience with ETL process and Data Migration.", "Experience with different Reporting/BI tools i.e. PowerBI, Cristal Report, ", "Report etc.", "Understanding of Azure or other cloud database offerings"], "location": "Dhaka", "deadline": "July 31, 2020 (Early Applications will be given preference)", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization."},
{"company_name": "Relisource", "post": "Business Process Associate", "link": "https://www.relisource.com/job-post/business-process-associate/", "educational_requirements": ["Bachelor’s in any field."], "job_responsibility": ["Dynamic individuals capable of consistently delivering & exceeding expectations in the following:"], "job_requirements": ["Managing and tracking documentation from client-side and other stakeholders.", "Performing document quality assurance to ensure it is error free.", "Maintaining task and issue logs.", "Working assigned tasks within deadlines.", "Utilizing given software for effective communication between all stakeholders.", "Ensuring effective work output."], "location": "Dhaka", "deadline": "August 31, 2020.  (Early Applications will be given preference)", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization."},
{"company_name": "Relisource", "post": "Web Developer", "link": "https://www.relisource.com/job-post/web-developer/", "educational_requirements": ["B.Sc. in Computer Science & Engineering is preferred but not mandatory."], "job_responsibility": ["The individual will develop websites and Content Management System.This individual will have to be proficient in PHP, WordPress, HTML, CSS, JavaScript. Alongside, s/he will perform other responsibilities as described below."], "job_requirements": ["Develop small scale responsive web applications with JavaScript, HTML5 & CSS/CSS3.", "Must have very good understanding in PHP and WordPress.", "Good to have prior experience in custom WordPress development.", "Demonstrate a solid understanding of development process and remain current on trends.", "Meet deadlines in a fast-paced environment with multiple assignments occurring simultaneously."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization."},
{"company_name": "Relisource", "post": "Technical Research Associate (TRA)", "link": "https://www.relisource.com/job-post/technical-research-associate-tra/", "educational_requirements": ["Bachelor’s or Master’s degree with track record of publishing technical papers."], "job_responsibility": ["We are looking for a passionate technical research associate who will work with our Product Team, Development Team, Program Management Team and Sales Team to prepare all the necessary business/technical documentation required for ReliSource and its clients. The Technical Research Associate will develop product manuals, patent & trademark documents, how-to guides, website help sections, journal articles, and other content that distills technical information with ease and clarity. The TRA will also be responsible for researching and conducting literature reviews, collecting and analyzing data and preparing materials for submission to legal bodies, granting agencies and foundations. A strong sense of responsibility, accountability, proactiveness and good communication skills is a must for this position. Please DO NOT APPLY if you do not possess such skills.", "\r\n", "\r\nAs a whole, we are looking for a dynamic individual capable of consistently delivering & exceeding expectations in the following:", "\r\n"], "job_requirements": ["Contributes to the preparation of articles on research outcomes and progress and to the submission of same for publication.", "Work with internal teams to understand product documentation requirements.", "Write straight-forward user tutorials and interface text.", "Prepares or commissions graphics and illustrations to elaborate on or complement technical writing.", "Develop and maintain detailed databases of appropriate reference materials, including research, usability tests, and design specifications.", "Research, outline, write, and edit new and existing content, working closely with various departments to understand project requirements.", "Independently gather information from subject matter experts to develop, organize, and write procedure manuals, technical specifications, and process documentation.", "Research, create, and maintain information architecture templates that uphold organizational and legal standards, and allow for easy data migration.", "Meets with subject matter experts in order to ensure that specialized topics are appropriately addressed and discussed.", "Proven ability to manage large and complex databases and develop summary analysis, including summary tables and charts."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Competitive salary and long term benefits with excellent career opportunity in a focused & stable organization."},
{"company_name": "Relisource", "post": "Systems Administrator – Windows & VMware", "link": "https://www.relisource.com/job-post/systems-administrator-windows-vmware/", "educational_requirements": ["B.Sc. in Computer Science & Engineering or related field from any reputed university."], "job_responsibility": ["We are looking for dynamic individuals who meet the following requirements."], "job_requirements": ["Windows Server system administration experience in Windows Server 2008/2012/2016", "Work experience in VMware environment specially vSphere ESXi 6.0/6.5, vCenter 6.0/6.5 & Horizon View 6/7.", "Windows Client system administration experience in Windows 7/8.1/10 experience", "Deploy PC, server (Physical and Virtual/Cloud), and network hardware per approved system configurations and provide PC system troubleshooting and support for end users, including Office 2010 / 2013 /2016 suite", "Capable of diagnosing system hardware issues and software failures, communicates the remediation plans to users, and provide status updates.", "Install, Configure and maintain VMware platform, Windows and Linux operating systems and system software, and backup and recovery, system monitoring, disaster recovery, security, audit, capacity, and tool support. Additional responsibilities include Database Administration, & Network Security.", "Deployment of system and evaluating system performance issues including availability, utilization, throughput and latency; planning and executing the selection, installation, configuration, and testing of environment; defining policies and procedures; establishing connections and firewalls.", "Recommends solutions by defining database physical structure and functional capabilities, database security, data back-up, and recovery specifications.", "Independent problem solving; self-directed, self-starting with strong analytical and problem-solving skills", "Should have broad technical knowledge of current and emerging cyber threats, vulnerabilities, and technologies used both within the corporate infrastructure and in delivering customer-facing services.", "Understanding in SQL queries for both commercial and open source database solutions.", "Broad technical knowledge of current and emerging technologies used both within the corporate infrastructure and in delivering customer facing services", "Experience in a mid-to-large environment of Active Directory management and related services (group policy, DNS, DHCP, etc.)", "Experience with the installation, monitoring, maintenance, support and optimization of all VMware and Windows associated hardware, software, and services as require basis", "Monitor/analyze system performance and security, and provide & implement recommendations to make improvements as necessary."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization."},
{"company_name": "Relisource", "post": "SQA Engineer (Firmware)", "link": "https://www.relisource.com/job-post/sqa-engineer-firmware/", "educational_requirements": ["B.Sc. in Computer Science & Engineering from any reputed university."], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Knowledge on Microcontroller Firmware testing.", "Knowledge on testing Hardware Design.", "Knowledge on Current Test of a battery driven PCB.", "Strong problem solving and analytical ability.", "Able to work independently.", "Excellent communication skill in English.", "Motivated to learn and work with new technologies.", "High integrity and intellectuality.", "Must be a team player.", "High work Ethics & Professionalism."], "location": "Dhaka", "deadline": "August 21, 2020 (Early Applications will be given preference)"},
{"company_name": "Relisource", "post": "SQA Engineer (Database)", "link": "https://www.relisource.com/job-post/sqa-engineer-database/", "educational_requirements": ["B.Sc. in Computer Science & Engineering from any reputed university."], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization.", "Training on new technology.", "Overseas Tour with Opportunity to work with Global Companies.", "Most importantly a friendly work environment with opportunity to learn from a number of highly skilled mentors."], "location": "Dhaka", "deadline": "August 30, 2020 (Early applications will be given preference)"},
{"company_name": "Relisource", "post": "SQA Engineer", "link": "https://www.relisource.com/job-post/sqa-engineer/", "educational_requirements": ["B. Sc. in Computer Science & Engineering from any reputed university.", "Sc. in Electrical and Electronic Engineering (EEE)"], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Good to have knowledge on any test management tool like TFS, Helix or JAMA .", "Good to have knowledge on any project management tool like JIRA.", "Good to have knowledge on AWS pub sub model.", "Strong problem solving and analytical ability.", "Able to work independently.", "Excellent communication skill in English.", "Motivated to learn and work with new technologies.", "High integrity and intellectuality.", "Must be a team player.", "High work Ethics & Professionalism."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)"},
{"company_name": "Relisource", "post": "Software Engineer (.NET Platform)", "link": "https://www.relisource.com/job-post/software-engineer-dot-net-platform/", "educational_requirements": ["B. Sc. in Computer Science & Engineering from any reputed university."], "job_responsibility": ["We are looking for Dynamic individuals having the following Qualities:"], "job_requirements": ["Creative skill in problem solving and developing Algorithms.", "In-depth knowledge and working experience with Microsoft .NET technologies.", "Strong experience on writing complex SQL in SQL Server.", "Ability to design and develop system following Micro-service architecture.", "Experience with front-end frameworks like Angular is very much desired."], "location": "Dhaka", "deadline": "August 31, 2020 (Early applications will be given preference)", "salary_range": "Very Competitive Salary and Long Term Benefits with Excellent Career Opportunity in a Focused & Stable organization."}
]